URL = 'https://qa-scooter.praktikum-services.ru/'

# набор данных для первого теста (верхняя кнопка "Заказать")
order_data_1 = {
    "first_name": "Ян",
    "last_name": "Дексов",
    "address": "ул. Булочная, 1",
    "metro": "Арбатская",
    "phone": "+71112223344",
    "date": "25.09.2026",
    "rent_duration": "трое суток",
    "comment": "Привезите пожалуйста самый красивый самокат",
    "color": "black",
}

# набор данных для второго теста (нижняя кнопка "Заказать")
order_data_2 = {
    "first_name": "Лиза",
    "last_name": "Фоксова",
    "address": "ул. Лесная, 52",
    "metro": "Каширская",
    "phone": "+75556667788",
    "date": "10.10.2026",
    "rent_duration": "семеро суток",
    "comment": "А есть розовый?",
    "color": "grey",
}

# ответы на вопросы FAQ
FAQ_ANSWER_1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
FAQ_ANSWER_2 = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'
FAQ_ANSWER_3 = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
FAQ_ANSWER_4 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
FAQ_ANSWER_5 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
FAQ_ANSWER_6 = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
FAQ_ANSWER_7 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
FAQ_ANSWER_8 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'